/// Библиотека умного дома
/// Библиотека предоставляет структуру дома в комнатах которого расположены устройства.
/// Дом имеет название и содержит несколько помещений.
/// Библиотека позволяет запросить список помещений в доме.
/// Помещение имеет уникальное название и содержит названия нескольких устройств.
/// Устройство имеет уникальное в рамках помещения имя.
/// Библиотека позволяет получать список устройств в помещении.
/// Библиотека имеет функцию, возвращающую текстовый отчёт о состоянии дома.
pub mod devices;
pub mod error;
pub mod sh;
